{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "embedding/embeddings", "shape": [33, 64], "dtype": "float32"}, {"name": "conv1d/kernel", "shape": [6, 64, 384], "dtype": "float32"}, {"name": "conv1d/bias", "shape": [384], "dtype": "float32"}, {"name": "conv1d_1/kernel", "shape": [5, 384, 768], "dtype": "float32"}, {"name": "conv1d_1/bias", "shape": [768], "dtype": "float32"}, {"name": "dense/kernel", "shape": [768, 256], "dtype": "float32"}, {"name": "dense/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [256, 2], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [2], "dtype": "float32"}]}]}