{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.15.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "embedding_1/embeddings", "shape": [33, 64], "dtype": "float32"}, {"name": "conv1d_2/kernel", "shape": [6, 64, 384], "dtype": "float32"}, {"name": "conv1d_2/bias", "shape": [384], "dtype": "float32"}, {"name": "conv1d_3/kernel", "shape": [5, 384, 768], "dtype": "float32"}, {"name": "conv1d_3/bias", "shape": [768], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [768, 256], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [256, 27], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [27], "dtype": "float32"}]}]}